app/controllers/editor_controller.rb

  def create
    # Map all users out to a name, id pair for the select box
    @all_users = User.all.map { |a| [a.display_name, a.id] }
---
SELECT `users`.* FROM `users`